<a href="https://colab.research.google.com/github/renatauribes/hello-world/blob/main/ActividadFormativa_Equipo02.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
print("Hola bienvenidos")

Hola bienvenidos

In [ ]:
from google.colab import drive

In [ ]:
drive.mount('/content/drive')

Mounted at /content/drive

In [ ]:
from google.colab import drive
drive.mount('/content/drive')

Drive already mounted at /content/drive; to attempt to forcibly remount, call drive.mount("/content/drive", force_remount=True).

María del Carmen Vargas A00828570  
Renata Uribe Sanchez A01274629 
Frida Sofía A01235009
Diego Paasche Portillo A01028103

In [ ]:
import pandas as pd 
import numpy as np
import matplotlib.pyplot as plt

In [ ]:
df = pd.read_csv("/content/drive/Shareddrives/EQUIPO RETO CIENCIA DE DATOS/titanic (1).csv")
df

     PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0              1         0       3  ...   7.2500   NaN         S
1              2         1       1  ...  71.2833   C85         C
2              3         1       3  ...   7.9250   NaN         S
3              4         1       1  ...  53.1000  C123         S
4              5         0       3  ...   8.0500   NaN         S
..           ...       ...     ...  ...      ...   ...       ...
886          887         0       2  ...  13.0000   NaN         S
887          888         1       1  ...  30.0000   B42         S
888          889         0       3  ...  23.4500   NaN         S
889          890         1       1  ...  30.0000  C148         C
890          891         0       3  ...   7.7500   NaN         Q

[891 rows x 12 columns]

**Variables categóricas**: Name, Sex, Cabin, Ticket, Embarked, Pclass, Survived, PassengerId.
**Variables numéricas:**Age, SibSp, Parch, Fare.

**Describe() muestra las medidas de tendencia básica de nuestra base de datos.**

In [ ]:
df.describe()

       PassengerId    Survived      Pclass  ...       SibSp       Parch        Fare
count   891.000000  891.000000  891.000000  ...  891.000000  891.000000  891.000000
mean    446.000000    0.383838    2.308642  ...    0.523008    0.381594   32.204208
std     257.353842    0.486592    0.836071  ...    1.102743    0.806057   49.693429
min       1.000000    0.000000    1.000000  ...    0.000000    0.000000    0.000000
25%     223.500000    0.000000    2.000000  ...    0.000000    0.000000    7.910400
50%     446.000000    0.000000    3.000000  ...    0.000000    0.000000   14.454200
75%     668.500000    1.000000    3.000000  ...    1.000000    0.000000   31.000000
max     891.000000    1.000000    3.000000  ...    8.000000    6.000000  512.329200

[8 rows x 7 columns]

**columns() lee los títulos de cada columna.**

In [ ]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

**info() imprime los primeros y últimos 5 datos de la base de datos.**

In [ ]:
df.info

<bound method DataFrame.info of      PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0              1         0       3  ...   7.2500   NaN         S
1              2         1       1  ...  71.2833   C85         C
2              3         1       3  ...   7.9250   NaN         S
3              4         1       1  ...  53.1000  C123         S
4              5         0       3  ...   8.0500   NaN         S
..           ...       ...     ...  ...      ...   ...       ...
886          887         0       2  ...  13.0000   NaN         S
887          888         1       1  ...  30.0000   B42         S
888          889         0       3  ...  23.4500   NaN         S
889          890         1       1  ...  30.0000  C148         C
890          891         0       3  ...   7.7500   NaN         Q

[891 rows x 12 columns]>

**De las variables categóricas indica cuantos valores diferentes se tiene por categoría texto en negrita**

In [ ]:
sex = df.Sex
sex.value_counts()

male      577
female    314
Name: Sex, dtype: int64

In [ ]:
name = df.Name
name.value_counts()

Pettersson, Miss. Ellen Natalia                             1
Williams, Mr. Charles Eugene                                1
Pain, Dr. Alfred                                            1
Allum, Mr. Owen George                                      1
Lobb, Mrs. William Arthur (Cordelia K Stanlick)             1
                                                           ..
Perkin, Mr. John Henry                                      1
Slabenoff, Mr. Petco                                        1
Saad, Mr. Amin                                              1
Sivola, Mr. Antti Wilhelm                                   1
Spedden, Mrs. Frederic Oakley (Margaretta Corning Stone)    1
Name: Name, Length: 891, dtype: int64

In [ ]:
cabin = df.Cabin
cabin.value_counts()

G6             4
B96 B98        4
C23 C25 C27    4
F2             3
D              3
              ..
C46            1
D19            1
D46            1
C30            1
E10            1
Name: Cabin, Length: 147, dtype: int64

In [ ]:
ticket = df.Ticket
ticket.value_counts()

CA. 2343             7
1601                 7
347082               7
CA 2144              6
347088               6
                    ..
244270               1
372622               1
SC/AH Basle 541      1
PC 17600             1
STON/O 2. 3101288    1
Name: Ticket, Length: 681, dtype: int64

In [ ]:
embarked = df.Embarked
embarked.value_counts()

S    644
C    168
Q     77
Name: Embarked, dtype: int64

**Indica cuánto es el total que se pagó sumando la tarifa de todos los pasajeros.**

In [ ]:
fare = df.Fare
fare.sum()

28693.9493

**Crear un subconjunto de los datos de los que sobrevivieron y otro de los que no sobrevivieron**

**Mostrar los datos de 5 personas de las que sobrevivieron y de las que no sobrevivieron.**